
/*********************************************************************************************************
 **                                                                                                      **
 **   Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.   **
 **                                                                                                      **
 *********************************************************************************************************/


let arr1 = [1, 2, 3, 4, 5];
for(let i = 0; i < arr1.length; i++) {
  console.log(arr1[i]);
}

/*********************************************************************************************************
 **                                                                                                      **
 **  Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите сумму элементов этого массива. **
 **  Запишите ее в переменную result.                                                                    **
 **                                                                                                      **
 *********************************************************************************************************/

let arr2 = [1, 2, 3, 4, 5];
let res1 = 0;
for (let i = 0; i < arr2.length; i++) {
  res1 += arr2[i];
  console.log(res1);
}

/*********************************************************************************************************
 **                                                                                                      **
 **  Дан объект obj. С помощью цикла for-in выведите на экран ключи и элементы этого объекта.            **
 **  var obj = {green: 'зеленый', red: 'красный', blue: 'голубой'}.                                      **
 **                                                                                                      **
 *********************************************************************************************************/

let obj1 = {
  green: 'зеленый',
  red: 'красный',
  blue: 'голубой'
};
for(let key in obj1) {
  console.log(key, obj1[key]);
}

/*********************************************************************************************************
 **                                                                                                      **
 **  Дан объект obj с ключами Коля, Вася, Петя с элементами '200', '300', '400'. С помощью цикла for-in  **
 **  выведите на экран строки такого формата: 'Коля - зарплата 200 долларов.'.                           **
 **                                                                                                      **
 *********************************************************************************************************/

let obj2 = {
  'Коля': '200',
  'Вася': '300',
  'Петя': '400'
};


for (let key in obj2) {
  console.log(`${key} - зарплата ${parseFloat(obj2[key])} долларов`);
}

/*********************************************************************************************************
 **                                                                                                      **
 **  Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на           **
 **  экран столбец тех элементов массива, которые больше 3-х, но меньше 10.                              **
 **                                                                                                      **
 *********************************************************************************************************/

let arr3 = [2, 5, 9, 15, 0, 4];

for (let i = 0; i < arr3.length; i++) {

  if (arr3[i] > 3 && 10 > arr3[i]) {
    console.log(arr3[i]);
  }
}

/*********************************************************************************************************
 **                                                                                                      **
 **  Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных **
 **  элементов массива. Цикл while                                                                       **
 **                                                                                                      **
 *********************************************************************************************************/

let arr4 = [-100, -20, 20, 40];
let sum = 0;
let i = 0;

while (i < arr4.length) {
  if (arr4[i] > 0){
    sum += arr4[i];
  }
  i++;
}
console.log(sum);
/*********************************************************************************************************
 **                                                                                                      **
 ** Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла do... while и оператора            **
 ** if проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' **
 ** и выйдите ** из цикла. Если нет - ничего делать не надо.                                             **
 **                                                                                                      **
 *********************************************************************************************************/

let arr5 = [1, 2, 5, 9, 4, 13, 4, 10];
let j = 0;
do {
  if (arr5[j] === 4){
    console.log('Есть!');
    break;
  }
  j++;
} while (j < arr5.length);